nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/eiq_examples/mpp/src/host_video.c
    OSA_SR_ALLOC();

    /* sdcard write picture buffer has had picture */
    if (videoAppInstance->pictureBufferState[videoAppInstance->sdcardWriteBufferIndex])
    {
        if (!s_FileOpened)
        {
            if (s_PictureIndex > USB_VIDEO_PICTURE_COUNT) /* finished pictures, start overlay from the first pic */
            {
                s_PictureIndex = 1;
            }
            if (videoAppInstance->cameraDeviceFormatType == USB_HOST_DESC_SUBTYPE_VS_FORMAT_MJPEG)
            {
                sprintf(fileName, "%spic%d.jpg", &g_DriverNumberBuffer[0], s_PictureIndex);
            }
            else if (videoAppInstance->cameraDeviceFormatType == USB_HOST_DESC_SUBTYPE_VS_FORMAT_UNCOMPRESSED)
            {
                sprintf(fileName, "%spic%d.yuv", &g_DriverNumberBuffer[0], s_PictureIndex);
            }
            else
            {
                return;
            }

#if USE_SD
            fileStatus = f_open(&fileObj, _T(fileName), FA_WRITE | FA_CREATE_ALWAYS);
            if (FR_OK != fileStatus)
            {
                usb_echo("sdcard operate fail\r\n");
                return;
            }
#endif
            s_FileOpened = 1;
        }

#if USE_SD

        fileStatus = f_write(&fileObj, (uint8_t *)&s_pictureBuffer[videoAppInstance->sdcardWriteBufferIndex][0],
                             videoAppInstance->sdcardPictureLength[videoAppInstance->sdcardWriteBufferIndex],
                             (UINT *)&writeSize);
        if ((fileStatus != FR_OK) ||
            (videoAppInstance->sdcardPictureLength[videoAppInstance->sdcardWriteBufferIndex] != writeSize))
        {
            usb_echo("sdcard operate fail\r\n");
        }
#endif

#ifdef PROCESS_IMAGE
        if (videoAppInstance->cameraDeviceFormatType == USB_HOST_DESC_SUBTYPE_VS_FORMAT_MJPEG)
        {
        	image_type = IMG_FORMAT_JPG;
        	frameDesc = (usb_host_video_stream_payload_frame_common_desc_t *)videoAppInstance->videoStreamMjpegFrameDescriptor;
        }
        else
        {
        	//TODO: not implemented yet
        	image_type = IMG_FORMAT_YUV422;
        	frameDesc = (usb_host_video_stream_payload_frame_common_desc_t *)videoAppInstance->videoStreamUncompressedFrameDescriptor;
        }


		/* choose a frame descriptor that has a minimum resolution */
		if (NULL != frameDesc)
		{
			width = (uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(frameDesc->wWitd));
			height = (uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(frameDesc->wHeight));

			Process_Image_Frame((uint8_t *)&s_pictureBuffer[videoAppInstance->sdcardWriteBufferIndex][0],
	        		            videoAppInstance->sdcardPictureLength[videoAppInstance->sdcardWriteBufferIndex],
	        		            width, height, image_type);
		}
#endif

        OSA_ENTER_CRITICAL();

        USB_HostVideoSdcardBufferState(videoAppInstance, videoAppInstance->sdcardWriteBufferIndex, 0);
        videoAppInstance->sdcardPictureLength[videoAppInstance->sdcardWriteBufferIndex] = 0;
        OSA_EXIT_CRITICAL();

        /* one frame picture finihsed and sync it */
        s_FileOpened = 0;
#if USE_SD 
       fileStatus   = f_sync(&fileObj);
        if (FR_OK != fileStatus)
        {
            usb_echo("file sync fail\r\n");
            return;
        }
#endif
#ifdef PRINT_FRAME_INFOS
        usb_echo("Pic:%d\r\n",s_PictureIndex);
#endif
        s_PictureIndex++;

        /* toggle the sdcard write picture index */
        videoAppInstance->sdcardWriteBufferIndex = 1 - videoAppInstance->sdcardWriteBufferIndex;
    }
}

/*!
 * @brief host usb video task function.
 *
 * This function implements the host video action, it is used to create task.
 *
 * @param param  the host video instance pointer.
 */
void USB_HostVideoTask(void *param)
{
    static usb_status_t status                                   = kStatus_USB_Success;
    usb_host_video_stream_payload_frame_common_desc_t *frameDesc = NULL;
    usb_host_video_camera_instance_t *videoAppInstance           = (usb_host_video_camera_instance_t *)param;
    uint32_t index, count;
#ifndef MATCH_RESOLUTION_FIXED
    uint32_t minResolution        = 0xFFFFFFFF;
    uint32_t resolution           = 0;
#endif
    uint8_t minSolutionFrameIndex = 0xFF;
    uint32_t frameInterval        = 0;
    uint32_t speed                = 0U;
    uint8_t i                     = 0;

    /* device state changes */
    if (videoAppInstance->devState != videoAppInstance->prevState)
    {
        videoAppInstance->prevState = videoAppInstance->devState;
        switch (videoAppInstance->devState)
        {
            case kStatus_DEV_Idle:
                break;

            case kStatus_DEV_Attached:
                videoAppInstance->runState                        = kUSB_HostVideoRunSetControlInterface;
                videoAppInstance->isControlTransferring           = 0;
                videoAppInstance->isStreamTransferring            = 0;
                videoAppInstance->streamBufferIndex               = 0;
                videoAppInstance->pictureBufferIndex              = 0;
                videoAppInstance->sdcardWriteBufferIndex          = 0;
                videoAppInstance->discardPictureCount             = 0;
                videoAppInstance->pictureBufferState[0]           = 0;
                videoAppInstance->pictureBufferState[1]           = 0;
                videoAppInstance->cameraDeviceFormatType          = 0;
                videoAppInstance->unMultipleIsoMaxPacketSize      = 0;
                videoAppInstance->currentStreamInterfaceAlternate = 0;
                videoAppInstance->expect_frame_id                 = 0xFF;
                videoAppInstance->discardFirstPicture =
                    1; /* dicard the first picture because the first picture may be not complete */
                s_pictureBufferDataLength[0] = 0;
                s_pictureBufferDataLength[1] = 0;
                videoAppInstance->step       = 0;
                s_PictureIndex               = 1; /* the first picture index is 1 */
                USB_HostVideoInit(videoAppInstance->deviceHandle, &videoAppInstance->classHandle);
                usb_echo("USB video attached\r\n");
                break;

            case kStatus_DEV_Detached:
                videoAppInstance->devState     = kStatus_DEV_Idle;
                videoAppInstance->runState     = kUSB_HostVideoRunIdle;
                videoAppInstance->runWaitState = kStatus_DEV_Idle;
                /* free the two picture buffer */
#ifdef USB_IMG_BUFFER_DYNALLOC
                vPortFree((void *)s_pictureBuffer_unaligned[0]);
                vPortFree((void *)s_pictureBuffer_unaligned[1]);
#endif
                USB_HostVideoDeinit(videoAppInstance->deviceHandle, videoAppInstance->classHandle);
                videoAppInstance->classHandle = NULL;
                usb_echo("USB video detached\r\n");
                if (s_PictureIndex > 0)
                {
                    usb_echo("the last saved picture index is %d\r\n", s_PictureIndex - 1U);
                }
                usb_echo("the total discarded picture count is %d\r\n", videoAppInstance->discardPictureCount);
                break;

            default:
                break;
        }
    }

    /* run state */
    switch (videoAppInstance->runState)
    {
        case kUSB_HostVideoRunIdle:
            break;

        case kUSB_HostVideoRunSetControlInterface:
            videoAppInstance->runWaitState = kUSB_HostVideoRunSetControlInterface;
            videoAppInstance->runState     = kUSB_HostVideoRunIdle;
            if (USB_HostVideoControlSetInterface(videoAppInstance->classHandle, videoAppInstance->controlIntfHandle, 0,
                                                 USB_HostVideoControlCallback, &g_Video) != kStatus_USB_Success)
            {
                usb_echo("set interface error\r\n");
            }
            break;
        case kUSB_HostVideoRunSetControlInterfaceDone:
            videoAppInstance->runWaitState                    = kUSB_HostVideoRunWaitSetStreamInterface;
            videoAppInstance->runState                        = kUSB_HostVideoRunIdle;
            videoAppInstance->currentStreamInterfaceAlternate = 0;
            if (USB_HostVideoStreamSetInterface(videoAppInstance->classHandle, videoAppInstance->streamIntfHandle,
                                                videoAppInstance->currentStreamInterfaceAlternate,
                                                USB_HostVideoControlCallback, &g_Video) != kStatus_USB_Success)
            {
                usb_echo("set interface error\r\n");
            }
            break;
        case kUSB_HostVideoRunSetInterfaceDone:
            videoAppInstance->runState = kUSB_HostVideoRunFindOptimalSetting;
            break;
        case kUSB_HostVideoRunFindOptimalSetting:

        	/* use MJPEG format by default */
#if ((MATCH_FORMAT == MATCH_FORMAT_MJPEG) || (MATCH_FORMAT == MATCH_FORMAT_ANY))
         	/* Try to get MJPEG format descriptor */
                status = USB_HostVideoStreamGetFormatDescriptor(videoAppInstance->classHandle,
                                                                USB_HOST_DESC_SUBTYPE_VS_FORMAT_MJPEG,
                                                                (void *)&videoAppInstance->videoStreamFormatDescriptor);
                if (status == kStatus_USB_InvalidHandle)
                {
                    usb_echo("videoAppInstance->classHandle is invalid\r\n");
                }
                else if (status == kStatus_USB_Error)
                {
                           usb_echo(" host can't support this format camera device\r\n");
                           videoAppInstance->runState = kUSB_HostVideoRunIdle;
                }
#else
                /* Try to get UNCOMPRESSED format */
                status = USB_HostVideoStreamGetFormatDescriptor(videoAppInstance->classHandle,
                                                                USB_HOST_DESC_SUBTYPE_VS_FORMAT_UNCOMPRESSED,
                                                                (void *)&videoAppInstance->videoStreamFormatDescriptor);
                if (status == kStatus_USB_InvalidHandle)
                {
                    usb_echo("videoAppInstance->classHandle is invalid\r\n");
                }
                else if (status == kStatus_USB_Error)
                {
                    usb_echo(" host can't support this format camera device\r\n");
                    videoAppInstance->runState = kUSB_HostVideoRunIdle;
                }

#endif

            /* Successfully get MJPEG or UNCOMPRESSED format descriptor */
            if (status == kStatus_USB_Success)
            {
                count = videoAppInstance->videoStreamFormatDescriptor->bNumFrameDescriptors;
                videoAppInstance->cameraDeviceFormatType =
                    videoAppInstance->videoStreamFormatDescriptor->bDescriptorSubtype;
                if (videoAppInstance->cameraDeviceFormatType ==
                    USB_HOST_DESC_SUBTYPE_VS_FORMAT_MJPEG) /* camera device supports mjpeg format */
                {
                    videoAppInstance->videoStreamMjpegFormatDescriptor =
                        (usb_host_video_stream_payload_mjpeg_format_desc_t *)
                            videoAppInstance->videoStreamFormatDescriptor;
                }
                else if (videoAppInstance->cameraDeviceFormatType ==
                         USB_HOST_DESC_SUBTYPE_VS_FORMAT_UNCOMPRESSED) /* camera device supports uncompressed format */
                {
                    videoAppInstance->videoStreamUncompressedFormatDescriptor =
                        (usb_host_video_stream_payload_uncompressed_format_desc_t *)
                            videoAppInstance->videoStreamFormatDescriptor;
                }

                //usb_echo("Listing camera %d supported resolutions: \r\n", count);
                /* Choose a minimum resolution video stream frame descriptor */
                for (index = 1; index <= count; index++)
                {
                    /* Get the subordinate frame descriptor */
                    if (videoAppInstance->cameraDeviceFormatType == USB_HOST_DESC_SUBTYPE_VS_FORMAT_MJPEG)
                    {
                        status = USB_HostVideoStreamGetFrameDescriptor(
                            videoAppInstance->classHandle, videoAppInstance->videoStreamFormatDescriptor,
                            USB_HOST_DESC_SUBTYPE_VS_FRAME_MJPEG, index, (void *)&frameDesc);
                    }
                    else if (videoAppInstance->cameraDeviceFormatType == USB_HOST_DESC_SUBTYPE_VS_FORMAT_UNCOMPRESSED)
                    {
                        status = USB_HostVideoStreamGetFrameDescriptor(
                            videoAppInstance->classHandle, videoAppInstance->videoStreamFormatDescriptor,
                            USB_HOST_DESC_SUBTYPE_VS_FRAME_UNCOMPRESSED, index, (void *)&frameDesc);
                    }

                    /* choose a frame descriptor that has a minimum resolution */
                    if ((kStatus_USB_Success == status) && (NULL != frameDesc))
                    {
                    	uint32_t fd_width;
                    	uint32_t fd_height;

                    	fd_width = (uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(frameDesc->wWitd));
                    	fd_height = (uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(frameDesc->wHeight));

                        //usb_echo("%d: w:%u h:%u ", index, fd_width , fd_height);
                        if (videoAppInstance->cameraDeviceFormatType == USB_HOST_DESC_SUBTYPE_VS_FORMAT_MJPEG)
                        {

